import React from 'react';
import Header from '../components/Header'

function App(){
    return(
        <>
        <Header/>
        <div style={{'margin':'3rem 1rem 1rem 1rem','border':'1.5px solid #e2e2e2','padding':'1rem','border-radius':'1rem','line-height':'2rem'}}>
        <h2>개인정보처리방침</h2>
        <p>
        <h3>1. 개인정보 처리방침</h3>
        </p>
        <p>개인정보 처리방침은 회사가 서비스를 제공함에 있어, 개인정보를 어떻게 수집·이용·보관·파기하는지에 대한 정보를 담은 방침을 의미합니다. 개인정보 처리방침은 개인정보보호법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률 등 국내 개인정보 보호 법령을 모두 준수하고 있습니다. 이 약관의 정의는 서비스 이용약관을 따릅니다.</p>
         <p>
        <h3>2. 수집하는 개인정보의 항목</h3>
        </p>
        <p>회사는 서비스 제공을 위해 아래 항목 중 최소한의 개인정보를 수집합니다.</p><ol>  <li>회원가입을 할 경우</li>  <ol>    <li>이름, 학년, 반, 이메일주소</li> </ol>  <li>학생증 인증을 할 경우</li><ol>    <li>학생증</li>  </ol> </ol>  <p>  ※ 각 항목 또는 추가적으로 수집이 필요한 개인정보 및 개인정보를 포함한 자료는 이용자 응대 과정과 서비스 내부 알림 수단 등을 통해 별도로 요청·수집될 수 있습니다.<br/> ※ 서비스 이용 과정에서 기기 정보, 이용 기록, 로그 기록이 자동으로 수집될 수 있습니다.</p>
        <p>
                <h3>3. 수집한 개인정보의 이용</h3>
        </p>
        <p>
        회사는 쾌적한 서비스를 제공하기 위해, 아래의 목적에 한해 개인정보를 이용합니다.</p><ol>  <li>가입 및 탈퇴 의사 확인, 회원 식별, 재학생 및 졸업생 확인 등 회원 관리</li>  <li>서비스 제공 및 기존·신규 시스템 개발·유지·개선</li>  <li>불법·약관 위반 게시물 게시 등 부정행위 방지를 위한 운영 시스템 개발·유지·개선</li>  <li>인구통계학적 자료 분석을 통한 맞춤형 콘텐츠 및 광고 제공</li> <li>문의·제휴·광고·이벤트·게시 관련 요청 응대 및 처리</li></ol>
        <h3>4. 개인정보의 제3자 제공 및 처리위탁</h3>
        <p>회사는 관련법 및 회원의 동의가 없는 한, 회원의 개인정보를 제3자에게 절대 제공하지 않습니다. 단, 회사는 보안성 높은 서비스 제공을 위하여, 신뢰도가 검증된 아래 회사에 개인정보 관련 업무 처리를 위탁할 수 있습니다. 이 경우 회사는 회원에게 위탁을 받는 자와 업무의 내용을 사전에 알리고 동의를 받습니다. 위탁을 받는 자 또는 업무의 내용이 변경될 경우에도 같습니다.</p><p>회사는 정보통신서비스의 제공에 관한 계약을 이행하고 회원의 편의 증진 등을 위하여 추가적인 처리 위탁이 필요한 경우에는 고지 및 동의 절차를 거치지 않을 수 있습니다.</p><ol>  <li>Amazon Web Service : 서비스 시스템 제공, 데이터 관리 및 보관</li>  <li>Google Cloud Platform : 회원 관리, 운영 시스템 지원</li></ol>
        <h3>5. 수집한 개인정보의 보관 및 파기</h3><p>회사는 서비스를 제공하는 동안 개인정보 취급방침 및 관련법에 의거하여 회원의 개인정보를 지속적으로 관리 및 보관합니다. 탈퇴 등으로 인해 개인정보 수집 및 이용목적이 달성될 경우, 수집된 개인정보는 즉시 또는 아래와 같이 일정 기간 이후 파기됩니다.</p><ol>  <li>이용기록 : 탈퇴 시 즉시 파기</li>  <li>가입 및 학생증 인증 시 수집된 개인정보 : 탈퇴 후 14일</li>  <li>제휴·광고·이벤트 관련 요청 응대 및 처리 자료 : 3개월</li>  <li>재학생 인증 요청 자료 : 3개월</li><li>게시요청 관리자 정보 : 마지막 접속일로부터 2년</li>  <li>로그기록 : 최대 3년</li>  <li>이용자 문의 자료 : 3년</li> <li>게시중단 요청 자료 : 3년</li></ol><p>  ※ 위 항에도 불구하고 법령에 의해 개인정보를 보관할 경우, 해당 법령에서 정한 최대 기간만큼 저장합니다.<br/>  ※ 개인정보의 수집 및 이용 목적이 달성되지 않았을 경우, 개인정보 파기 요청은 처리되지 않습니다.<br/>  ※ 개인정보 파기는 복구가 불가능한 기술적 방법을 이용하므로, 파기된 개인정보를 복원 할 수 없습니다.<br/>  ※ 회원이 1년 이상 로그인 및 접속을 하지 않을 경우, 해당 계정은 휴면 계정으로 전환됩니다. 개인정보의 안전한 처리를 위해 휴면 계정의 학년, 반, 아이디, 이메일, 이름, 닉네임, 연계정보는 분리 보관되며, 이외의 개인정보 및 이용기록은 모두 파기될 수 있습니다. 휴면 계정이 로그인에 성공할 경우, 휴면 상태가 즉시 해제되어 모든 서비스를 이용할 수 있습니다. 휴면 계정 전환 이후에도 3년 간 로그인을 하지 않을 경우, 해당 계정은 영구 삭제됩니다.<br/>  ※ 학생증 인증 시, 위조·도용 피해를 방지하기 위해 학교, 학번, 학교 이메일을 비식별화하여 1년간 보관합니다.<br/>  ※ 부정행위 시, 제재를 위해 IP 주소 및 비식별화한  학번, 연계정보를 최대 1년 간 보관합니다. 단 커뮤니티 유출, 시스템 해킹, 학교 인증자료 위·변조, 계정 탈취·판매 등의 중대한 부정행위로 서비스에 피해가 발생할 수 있다고 판단될 경우, 추가 피해 방지를 위해 이를 5년 간 보관합니다.<br/>  ※ 비식별화란? 일방향 암호화 처리를 하는 과정을 말합니다. 비식별화된 정보는 복호화가 불가능하며, 누구라도 이 정보로 개인을 식별하거나 유추할 수 없습니다.</p><h3>6. 정보주체의 권리, 의무 및 행사</h3><p>회원은 언제든지 [내 정보]를 통해 자신의 개인정보를 조회하거나 수정, 삭제, 탈퇴를 할 수 있습니다.</p>
        <h3>7. 쿠키</h3>
        <p>쿠키란 웹사이트를 운영하는 데 이용되는 서버가 귀하의 브라우저에 보내는 아주 작은 텍스트 파일로서 귀하의 컴퓨터 하드디스크에 저장됩니다. 서비스는 사이트 로그인을 위해 아이디 식별에 쿠키를 사용할 수 있습니다.</p><p>쿠키 설정 거부 방법 예시</p><ol>  <li>Internet Explorer : 웹 브라우저 상단의 도구 > 인터넷 옵션 > 개인정보 > 설정</li>  <li>Chrome : 웹 브라우저 우측의 설정 > 고급 설정 표시 > 개인정보의 콘텐츠 설정 버튼 > 쿠키</li></ol>
        <h3>8. 개인정보에 관한 책임자 및 서비스</h3><ol>
        <li>개인정보보호 담당자 : 서하연</li>
        <li> 메일 : hyseo0208@gmail.com</li>
        </ol><p>※ 서비스 이용, 접근 제한 등의 문의는 개인정보보호 담당자를 통해 처리되지 않습니다. 해당 문의는 <a href="/page/faq">[문의하기]</a>를 통해 전달해주시기 바랍니다.</p><p>기타 개인정보침해에 대한 신고나 상담이 필요하신 경우에는 아래 기관에 문의하시기 바랍니다.</p><ol>  <li>개인분쟁조정위원회 (www.1336.or.kr / 1336)</li>  <li>정보보호마크인증위원회 (www.eprivacy.or.kr / 02-580-0533~4)</li>  <li>대검찰청 인터넷범죄수사센터 (icic.sppo.go.kr / 02-3480-3600)</li>  <li>경찰청 사이버테러대응센터 (www.ctrc.go.kr / 02-392-0330)</li></ol><h3>10. 기타</h3><p>이 약관은 2021년 7월 16일에 최신화 되었습니다.</p><p>본 약관의 내용 추가, 삭제 및 수정이 있을 경우 개정 최소 7일 전에 ‘공지사항’을 통해 사전 공지를 할 것입니다. 다만, 수집하는 개인정보의 항목, 이용목적의 변경 등과 같이 회원 권리의 중대한 변경이 발생할 때에는 최소 30일 전에 공지하거나, 동의를 다시 받도록 하겠습니다.</p>
        </div>
        </>
        )
}

export default App